{"pageProps":{"post":{"mdxSource":"var Component=(()=>{var d=Object.create;var r=Object.defineProperty;var c=Object.getOwnPropertyDescriptor;var u=Object.getOwnPropertyNames;var m=Object.getPrototypeOf,w=Object.prototype.hasOwnProperty;var s=a=>r(a,\"__esModule\",{value:!0});var p=(a,o)=>()=>(o||a((o={exports:{}}).exports,o),o.exports),y=(a,o)=>{s(a);for(var n in o)r(a,n,{get:o[n],enumerable:!0})},f=(a,o,n)=>{if(o&&typeof o==\"object\"||typeof o==\"function\")for(let t of u(o))!w.call(a,t)&&t!==\"default\"&&r(a,t,{get:()=>o[t],enumerable:!(n=c(o,t))||n.enumerable});return a},g=a=>f(s(r(a!=null?d(m(a)):{},\"default\",a&&a.__esModule&&\"default\"in a?{get:()=>a.default,enumerable:!0}:{value:a,enumerable:!0})),a);var l=p((C,h)=>{h.exports=_jsx_runtime});var j={};y(j,{default:()=>k,frontmatter:()=>v});var e=g(l()),v={title:\"1,234 days \\u2014 Day 1 at Fossil\",authors:[\"nga\"],date:\"2020-02-27\",tags:[\"life\"],summary:\"A thousand-ish more days later, I could definitely testify to the jaded Day 1 philosophy by Amazon CEO Jeff Bezos: Every day here has felt just like Day 1.\",layout:\"PostLayout\"};function b(a={}){let{wrapper:o}=a.components||{};return o?(0,e.jsx)(o,Object.assign({},a,{children:(0,e.jsx)(n,{})})):n();function n(){let t=Object.assign({p:\"p\",em:\"em\",div:\"div\"},a.components),{Image:i}=t;return i||I(\"Image\",!0),(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(t.p,{children:\"I\\u2019m leaving Fossil in a few weeks.\"}),`\n`,(0,e.jsx)(t.p,{children:\"A thousand-ish more days later, I could definitely testify to the jaded Day 1 philosophy by Amazon CEO Jeff Bezos: Every day here has felt just like Day 1.\"}),`\n`,(0,e.jsx)(t.p,{children:\"I joined Fossil Misfit when the deal uniting traditional watchmakers with Silicon Valley talents had just been completed \\u2014 in fact, my first day at work was also our first day in the new office under the Fossil brand name. Misfit was a figure of much buzz among national and regional startup community, while the core of Fossil \\u2014 fashion, was usually not known for being tech-savvy. The transition became extremely challenging as an innovative culture integrates into a traditional system with decades of history.\"}),`\n`,(0,e.jsxs)(t.p,{children:[\"I started with the Customer Service (CS) team as a Technical Support Associate when many old Misfit employees left the company due to these changes. Having graduated with a very good degree from a top Economics college in Vietnam, telling people that I was working in Customer Service meant that I would always get a second look, coupled with some moments of silence: \",(0,e.jsx)(t.em,{children:\"What are you doing? Answering end-user requests does not seem like a legit job.\"})]}),`\n`,(0,e.jsx)(t.p,{children:\"Truth is, clueless as I was, from the moment I walked into the interview room, I have been surrounded by incredible CS people who have encouraged me to do things out of my comfort zone.\"}),`\n`,(0,e.jsx)(t.p,{children:\"Unlike the prejudice against call center people taking menial tasks, I came to work every day amazed by the various types of problems that we had to deal with. 20 people in Vietnam established a technical information system for thousands of customer service, sales, and business agents globally, who had been complete tech novices so that Fossil can continuously deliver world-class support to our users. I learned customer obsession the hard way.\"}),`\n`,(0,e.jsx)(t.p,{children:\"2 years with CS team and a new avenue was opened for me when I moved to Cloud team under Software Engineering to help manage technical projects and had the privilege of working with so many talented people.\"}),`\n`,(0,e.jsx)(t.p,{children:\"I admire that even a small team like Cloud had a bold set of values and practices that were so very different than any other workplace I had known before: you know that people will always have your back, insulate you from others\\u2019 bullshits and be straightforward with your own.\"}),`\n`,(0,e.jsx)(t.div,{children:(0,e.jsx)(i,{alt:\"An excerpt from our wiki page\",src:\"/media/2020/1234.png\",width:\"708\",height:\"708\"})}),`\n`,(0,e.jsx)(t.p,{children:\"Look at me for a clear-cut example.\"}),`\n`,(0,e.jsx)(t.p,{children:\"Most people, when they recruit for a role, only look for people who have excelled in that role before. This is not how we hire, or at least from my perspective, how we find a learning animal around here. Or else I would never have ended up where I am today (Under occasional imposter syndrome, I still wonder how I ended up here).\"}),`\n`,(0,e.jsx)(t.p,{children:\"The world is changing so fast, and even so much faster in tech that the role for which you\\u2019re hiring is going to change. \\u201CA smart generalist doesn\\u2019t have bias, so is free to survey the wide range of solutions and gravitate to the best one\\u201D(Eric Schmidt, How Google Works).\"}),`\n`,(0,e.jsx)(t.p,{children:\"As a non-tech person, I came to Cloud brimming with a billion questions, most of the time as stupid as it sounds to any good engineer. Still, everyone listens and takes the time to answer seriously. To me, all the backend, frontend, DevOps and data center talks are extremely interesting and novel. To my team, telling others what they are working on enables them to take another look at different problems with a clean slate, which sparks new thoughts and ideas. As a team, we understand how powerful a beginner mindset is.\"}),`\n`,(0,e.jsx)(t.p,{children:\"Fossil is not a perfect place: We are indeed struggling with an increasingly fiercer competition in the wearables business. Even though Fossil is a 36-year-old corporation, our tech center in Vietnam is very young, average at 25\\u201326 years of age. We have the dynamics and spirits of an aspiring team but lack the experience to effectively manage tough situations. From a Vietnam engineering perspective, there also exists an innate silo between software and firmware/hardware departments, which hinders cooperation, innovation, and agility of product management. More importantly, as one of my closest friends at work pointed out: Fossil is a watch company after all and we seem to be undervaluing the software behind the hardware of the watch.\"}),`\n`,(0,e.jsx)(t.p,{children:\"Yet, changes are happening: more cross-functional R&D projects have been successfully turned into real product features. We\\u2019re focusing more on leveraging the software and user data, at least from the Cloud perspective. We believe, and I quote, the hardware of most leading products should be similar, but the software is the one that differentiates them.\"}),`\n`,(0,e.jsx)(t.p,{children:\"With a sense of shared purposes, we trust one another to do the right things, however fluffy it might sound. Yeap, trust is not given. Yeap, trust must be earned. But yeap, we take building trust seriously: since my first day, my boss has been entirely transparent about the team\\u2019s culture, vision, and directions. These trusting culture traits can greatly shape how work gets done.\"}),`\n`,(0,e.jsxs)(t.p,{children:[\"One of my favorite things in Cloud is to meet one-on-one with my boss every 3 months, instead of the year-end review once per year, to discuss my career trajectory: \",(0,e.jsx)(t.em,{children:\"what I care about, where I want to go, what my strengths and weaknesses are, and how my team can support me to achieve whatever I am after.\"})]}),`\n`,(0,e.jsx)(t.p,{children:\"Ok, I don\\u2019t like it that much. But in Cloud, I know I don\\u2019t get to float my career by myself (notice the wordplay?). And seeing everyone grow with me is a huge motivation. We understand that the only way forward is through the work, and we aim to create excellent work for the team, the business, and the users.\"}),`\n`,(0,e.jsx)(t.p,{children:\"As serious as we are at work, we are also strictly serious about how we have fun: hard jokes, board game tricks, and jerk-free challenges have long become a norm. It\\u2019s not an understatement that I look forward to work almost every day with my pals.\"}),`\n`,(0,e.jsx)(t.div,{children:(0,e.jsx)(i,{alt:\"\",src:\"/media/2020/1235.gif\",width:\"245\",height:\"145\"})}),`\n`,(0,e.jsx)(t.p,{children:\"The hardest part of leaving is saying goodbye to the people that are so inspiring to work with and so fun to hang with. So all in all, thank you for the surreal, humbling, and wild journey. Some said that if you\\u2019re lucky, you will have many folks in your life who will support, encourage and help you. I\\u2019m blessed with a handful and wouldn\\u2019t be the person I am today without all of you.\"})]})}}var k=b;function I(a,o){throw new Error(\"Expected \"+(o?\"component\":\"object\")+\" `\"+a+\"` to be defined: you likely forgot to import, pass, or provide it.\")}return j;})();\n;return Component;","toc":[],"frontMatter":{"readingTime":{"text":"6 min read","minutes":5.845,"time":350700,"words":1169},"slug":"1234","fileName":"2020-02-27-1234.md","title":"1,234 days — Day 1 at Fossil","authors":["nga"],"date":"2020-02-27T00:00:00.000Z","tags":["life"],"summary":"A thousand-ish more days later, I could definitely testify to the jaded Day 1 philosophy by Amazon CEO Jeff Bezos: Every day here has felt just like Day 1.","layout":"PostLayout"}},"authorDetails":[{"readingTime":{"text":"1 min read","minutes":0.355,"time":21300,"words":71},"slug":["nga"],"fileName":"nga.md","name":"Nga Vu","avatar":"https://media-exp1.licdn.com/dms/image/C4D03AQHyOv95zj2GPw/profile-displayphoto-shrink_800_800/0/1640766259120?e=1652313600&v=beta&t=TmEoRO-6byfKKDdL4U_E83bYrKI-Fztouu6K1gkOEzU","occupation":"Technical Project Manager","company":"Fossil Vietnam","email":"vuthunga.287@gmail.com","linkedin":"https://www.linkedin.com/in/ngatvu/","github":"https://github.com/ngavu","date":null}],"prev":{"title":"Giảm kích thước Docker image cho ứng dụng Ruby on Rails","date":"2020-01-04T00:00:00.000Z","authors":["loi"],"tags":["engineering"],"summary":"Việc giảm dung lượng Docker image tuân theo nguyên tắc cơ bản nhất chính là loại bỏ các thành phần không cần thiết trong Docker image","slug":"docker-size"},"next":{"title":"Spark on Kubernetes tại Fossil","authors":["duyet"],"date":"2022-03-10T00:00:00.000Z","tags":["engineering","data"],"summary":"Apache Spark được chọn làm công nghệ cho Batch layer bởi khả năng xử lý một lượng lớn data cùng một lúc. Ở thiết kế ban đầu, team data chọn sử dụng Apache Spark trên AWS EMR do có sẵn và triển khai nhanh chóng. Dần dần, AWS EMR bộc lộ một số điểm hạn chế trên môi trường Production. Trong bài viết này, mình sẽ nói về tại sao và làm thế nào team Data chuyển từ Spark trên AWS EMR sang Kubernetes.","layout":"PostLayout","slug":"spark-on-kubernetes-at-fossil"}},"__N_SSG":true}